export interface KMAShortTermEntry {
  "날짜 시간": string;
  "기온": string;
  "풍향": string;
  "풍속": string;
  "하늘 상태": string;
  "강수 형태": string;
  "강수확률": string;
  "습도": string;
  "최고기온"?: string;
  "최저기온"?: string;
}

export const kmaShortTermData: KMAShortTermEntry[] = [
  {
    "날짜 시간": "20241210 0300",
    "기온": "3°C",
    "풍향": "북동",
    "풍속": "1.5m/s",
    "하늘 상태": "흐림",
    "강수 형태": "없음",
    "강수확률": "30%",
    "습도": "85%"
  },
  {
    "날짜 시간": "20241210 0600",
    "기온": "3°C",
    "풍향": "북동",
    "풍속": "1.8m/s",
    "하늘 상태": "흐림",
    "강수 형태": "없음",
    "강수확률": "30%",
    "습도": "85%"
  },
  {
    "날짜 시간": "20241210 0700",
    "기온": "2°C",
    "풍향": "북동",
    "풍속": "1.6m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "90%"
  },
  {
    "날짜 시간": "20241210 0800",
    "기온": "1°C",
    "풍향": "북동",
    "풍속": "1.4m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "90%"
  },
  {
    "날짜 시간": "20241210 0900",
    "기온": "3°C",
    "풍향": "북동",
    "풍속": "1.8m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "80%"
  },
  {
    "날짜 시간": "20241210 1000",
    "기온": "5°C",
    "풍향": "북동",
    "풍속": "1.9m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "70%"
  },
  {
    "날짜 시간": "20241210 1100",
    "기온": "6°C",
    "풍향": "북동",
    "풍속": "1.9m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "60%"
  },
  {
    "날짜 시간": "20241210 1200",
    "기온": "7°C",
    "풍향": "정보 없음",
    "풍속": "2.4m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "55%"
  },
  {
    "날짜 시간": "20241210 1300",
    "기온": "8°C",
    "풍향": "북",
    "풍속": "2.6m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "50%"
  },
  {
    "날짜 시간": "20241210 1400",
    "기온": "8°C",
    "풍향": "북서",
    "풍속": "2.7m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "50%"
  },
  {
    "날짜 시간": "20241210 1500",
    "기온": "8°C",
    "풍향": "북서",
    "풍속": "2.6m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "50%",
    "최고기온": "9.0°C"
  },
  {
    "날짜 시간": "20241210 1600",
    "기온": "8°C",
    "풍향": "북서",
    "풍속": "2.3m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "55%"
  },
  {
    "날짜 시간": "20241210 1700",
    "기온": "7°C",
    "풍향": "북서",
    "풍속": "1.4m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "60%"
  },
  {
    "날짜 시간": "20241210 1800",
    "기온": "6°C",
    "풍향": "북",
    "풍속": "1.6m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "70%"
  },
  {
    "날짜 시간": "20241210 1900",
    "기온": "5°C",
    "풍향": "정보 없음",
    "풍속": "1.6m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "75%"
  },
  {
    "날짜 시간": "20241210 2000",
    "기온": "5°C",
    "풍향": "북",
    "풍속": "1.8m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "75%"
  },
  {
    "날짜 시간": "20241210 2100",
    "기온": "4°C",
    "풍향": "북동",
    "풍속": "1.7m/s",
    "하늘 상태": "흐림",
    "강수 형태": "없음",
    "강수확률": "30%",
    "습도": "75%"
  },
  {
    "날짜 시간": "20241210 2200",
    "기온": "4°C",
    "풍향": "북",
    "풍속": "2m/s",
    "하늘 상태": "흐림",
    "강수 형태": "없음",
    "강수확률": "30%",
    "습도": "85%"
  },
  {
    "날짜 시간": "20241210 2300",
    "기온": "3°C",
    "풍향": "북동",
    "풍속": "1.8m/s",
    "하늘 상태": "흐림",
    "강수 형태": "없음",
    "강수확률": "30%",
    "습도": "80%"
  },
  {
    "날짜 시간": "20241211 0000",
    "기온": "3°C",
    "풍향": "북동",
    "풍속": "1.7m/s",
    "하늘 상태": "흐림",
    "강수 형태": "없음",
    "강수확률": "30%",
    "습도": "85%"
  },
  {
    "날짜 시간": "20241211 0100",
    "기온": "3°C",
    "풍향": "북동",
    "풍속": "1.7m/s",
    "하늘 상태": "흐림",
    "강수 형태": "없음",
    "강수확률": "30%",
    "습도": "85%"
  },
  {
    "날짜 시간": "20241211 0200",
    "기온": "3°C",
    "풍향": "북",
    "풍속": "1.8m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "85%"
  },
  {
    "날짜 시간": "20241211 0300",
    "기온": "3°C",
    "풍향": "북",
    "풍속": "2.1m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "85%"
  },
  {
    "날짜 시간": "20241211 0400",
    "기온": "3°C",
    "풍향": "북",
    "풍속": "2.1m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "85%"
  },
  {
    "날짜 시간": "20241211 0500",
    "기온": "2°C",
    "풍향": "북",
    "풍속": "2m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "90%"
  },
  {
    "날짜 시간": "20241211 0600",
    "기온": "2°C",
    "풍향": "북",
    "풍속": "1.7m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "85%",
    "최저기온": "1.0°C"
  },
  {
    "날짜 시간": "20241211 0700",
    "기온": "1°C",
    "풍향": "북동",
    "풍속": "1.5m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "90%"
  },
  {
    "날짜 시간": "20241211 0800",
    "기온": "1°C",
    "풍향": "북동",
    "풍속": "1.3m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "90%"
  },
  {
    "날짜 시간": "20241211 0900",
    "기온": "3°C",
    "풍향": "북",
    "풍속": "1.1m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "80%"
  },
  {
    "날짜 시간": "20241211 1000",
    "기온": "4°C",
    "풍향": "북",
    "풍속": "1.5m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "75%"
  },
  {
    "날짜 시간": "20241211 1100",
    "기온": "5°C",
    "풍향": "북",
    "풍속": "2.1m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "65%"
  },
  {
    "날짜 시간": "20241211 1200",
    "기온": "6°C",
    "풍향": "북",
    "풍속": "2.4m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "55%"
  },
  {
    "날짜 시간": "20241211 1300",
    "기온": "7°C",
    "풍향": "북",
    "풍속": "2.3m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "50%"
  },
  {
    "날짜 시간": "20241211 1400",
    "기온": "7°C",
    "풍향": "북서",
    "풍속": "2.4m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "50%"
  },
  {
    "날짜 시간": "20241211 1500",
    "기온": "8°C",
    "풍향": "북서",
    "풍속": "2.6m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "50%",
    "최고기온": "8.0°C"
  },
  {
    "날짜 시간": "20241211 1600",
    "기온": "7°C",
    "풍향": "북서",
    "풍속": "3m/s",
    "하늘 상태": "흐림",
    "강수 형태": "없음",
    "강수확률": "30%",
    "습도": "50%"
  },
  {
    "날짜 시간": "20241211 1700",
    "기온": "6°C",
    "풍향": "북서",
    "풍속": "1.8m/s",
    "하늘 상태": "흐림",
    "강수 형태": "없음",
    "강수확률": "30%",
    "습도": "55%"
  },
  {
    "날짜 시간": "20241211 1800",
    "기온": "4°C",
    "풍향": "북",
    "풍속": "2m/s",
    "하늘 상태": "흐림",
    "강수 형태": "없음",
    "강수확률": "30%",
    "습도": "65%"
  },
  {
    "날짜 시간": "20241211 1900",
    "기온": "3°C",
    "풍향": "북",
    "풍속": "2.1m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "65%"
  },
  {
    "날짜 시간": "20241211 2000",
    "기온": "2°C",
    "풍향": "북",
    "풍속": "1.7m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "65%"
  },
  {
    "날짜 시간": "20241211 2100",
    "기온": "1°C",
    "풍향": "정보 없음",
    "풍속": "1.3m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "70%"
  },
  {
    "날짜 시간": "20241211 2200",
    "기온": "1°C",
    "풍향": "북",
    "풍속": "1.3m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "70%"
  },
  {
    "날짜 시간": "20241211 2300",
    "기온": "1°C",
    "풍향": "북",
    "풍속": "1.3m/s",
    "하늘 상태": "흐림",
    "강수 형태": "없음",
    "강수확률": "30%",
    "습도": "75%"
  },
  {
    "날짜 시간": "20241212 0000",
    "기온": "1°C",
    "풍향": "정보 없음",
    "풍속": "1.1m/s",
    "하늘 상태": "흐림",
    "강수 형태": "없음",
    "강수확률": "30%",
    "습도": "75%"
  },
  {
    "날짜 시간": "20241212 0100",
    "기온": "0°C",
    "풍향": "북",
    "풍속": "1m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "75%"
  },
  {
    "날짜 시간": "20241212 0200",
    "기온": "0°C",
    "풍향": "북동",
    "풍속": "1m/s",
    "하늘 상태": "흐림",
    "강수 형태": "없음",
    "강수확률": "30%",
    "습도": "75%"
  },
  {
    "날짜 시간": "20241212 0300",
    "기온": "-1°C",
    "풍향": "북",
    "풍속": "1.5m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "80%"
  },
  {
    "날짜 시간": "20241212 0400",
    "기온": "-1°C",
    "풍향": "북",
    "풍속": "1.7m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "80%"
  },
  {
    "날짜 시간": "20241212 0500",
    "기온": "-1°C",
    "풍향": "북",
    "풍속": "1.7m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "80%"
  },
  {
    "날짜 시간": "20241212 0600",
    "기온": "-1°C",
    "풍향": "북",
    "풍속": "1.8m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "85%",
    "최저기온": "-2.0°C"
  },
  {
    "날짜 시간": "20241212 0700",
    "기온": "-1°C",
    "풍향": "북",
    "풍속": "2.1m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "85%"
  },
  {
    "날짜 시간": "20241212 0800",
    "기온": "-2°C",
    "풍향": "북동",
    "풍속": "1.3m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "85%"
  },
  {
    "날짜 시간": "20241212 0900",
    "기온": "1°C",
    "풍향": "북",
    "풍속": "1.8m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "75%"
  },
  {
    "날짜 시간": "20241212 1000",
    "기온": "3°C",
    "풍향": "북",
    "풍속": "2.6m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "65%"
  },
  {
    "날짜 시간": "20241212 1100",
    "기온": "4°C",
    "풍향": "북",
    "풍속": "2.7m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "50%"
  },
  {
    "날짜 시간": "20241212 1200",
    "기온": "5°C",
    "풍향": "북서",
    "풍속": "3.1m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "45%"
  },
  {
    "날짜 시간": "20241212 1300",
    "기온": "6°C",
    "풍향": "북서",
    "풍속": "3.1m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "40%"
  },
  {
    "날짜 시간": "20241212 1400",
    "기온": "6°C",
    "풍향": "북서",
    "풍속": "3.6m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "35%"
  },
  {
    "날짜 시간": "20241212 1500",
    "기온": "6°C",
    "풍향": "북",
    "풍속": "3.6m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "40%",
    "최고기온": "7.0°C"
  },
  {
    "날짜 시간": "20241212 1600",
    "기온": "6°C",
    "풍향": "북",
    "풍속": "3.3m/s",
    "하늘 상태": "맑음",
    "강수 형태": "없음",
    "강수확률": "0%",
    "습도": "40%"
  },
  {
    "날짜 시간": "20241212 1700",
    "기온": "4°C",
    "풍향": "정보 없음",
    "풍속": "1.6m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "45%"
  },
  {
    "날짜 시간": "20241212 1800",
    "기온": "3°C",
    "풍향": "정보 없음",
    "풍속": "1.6m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "50%"
  },
  {
    "날짜 시간": "20241212 1900",
    "기온": "2°C",
    "풍향": "북",
    "풍속": "1.4m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "55%"
  },
  {
    "날짜 시간": "20241212 2000",
    "기온": "2°C",
    "풍향": "북동",
    "풍속": "1.3m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "60%"
  },
  {
    "날짜 시간": "20241212 2100",
    "기온": "1°C",
    "풍향": "북",
    "풍속": "1.1m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "60%"
  },
  {
    "날짜 시간": "20241212 2200",
    "기온": "1°C",
    "풍향": "북동",
    "풍속": "1.4m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "65%"
  },
  {
    "날짜 시간": "20241212 2300",
    "기온": "1°C",
    "풍향": "북동",
    "풍속": "1.4m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "65%"
  },
  {
    "날짜 시간": "20241213 0000",
    "기온": "1°C",
    "풍향": "북",
    "풍속": "1m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "65%"
  },
  {
    "날짜 시간": "20241213 0300",
    "기온": "0°C",
    "풍향": "북동",
    "풍속": "1m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "70%"
  },
  {
    "날짜 시간": "20241213 0600",
    "기온": "0°C",
    "풍향": "동",
    "풍속": "1m/s",
    "하늘 상태": "흐림",
    "강수 형태": "없음",
    "강수확률": "30%",
    "습도": "70%",
    "최저기온": "-1.0°C"
  },
  {
    "날짜 시간": "20241213 0900",
    "기온": "0°C",
    "풍향": "동",
    "풍속": "1m/s",
    "하늘 상태": "흐림",
    "강수 형태": "없음",
    "강수확률": "30%",
    "습도": "65%"
  },
  {
    "날짜 시간": "20241213 1200",
    "기온": "5°C",
    "풍향": "남동",
    "풍속": "1m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "20%",
    "습도": "50%"
  },
  {
    "날짜 시간": "20241213 1500",
    "기온": "5°C",
    "풍향": "남서",
    "풍속": "1m/s",
    "하늘 상태": "흐림",
    "강수 형태": "비/눈",
    "강수확률": "60%",
    "습도": "65%",
    "최고기온": "6.0°C"
  },
  {
    "날짜 시간": "20241213 1800",
    "기온": "3°C",
    "풍향": "남동",
    "풍속": "1m/s",
    "하늘 상태": "흐림",
    "강수 형태": "비/눈",
    "강수확률": "60%",
    "습도": "85%"
  },
  {
    "날짜 시간": "20241213 2100",
    "기온": "1°C",
    "풍향": "북",
    "풍속": "2m/s",
    "하늘 상태": "흐림",
    "강수 형태": "없음",
    "강수확률": "30%",
    "습도": "85%"
  },
  {
    "날짜 시간": "20241214 0000",
    "기온": "0°C",
    "풍향": "북",
    "풍속": "1m/s",
    "하늘 상태": "구름 많음",
    "강수 형태": "없음",
    "강수확률": "10%",
    "습도": "85%"
  }
];

export async function initializeKMAShortTermData() {
  // This function can be used to fetch data dynamically if needed
  // For now, it's not necessary as we're using the static data above
}
