export interface OpenWeatherEntry {
    "날짜 시간": string;
    "기온": string;
    "풍향": string;
    "풍속": string;
    "하늘 상태": string;
    "강수 형태": string;
    "강수 확률": string;
    "습도": string;
}

export interface ProcessedOpenWeatherData {
    date: string;
    entries: OpenWeatherEntry[];
    highTemp: number;
    lowTemp: number;
}

export function processOpenWeatherData(data: OpenWeatherEntry[]): ProcessedOpenWeatherData[] {
    const processedData: { [key: string]: ProcessedOpenWeatherData } = {};

    data.forEach((entry: OpenWeatherEntry) => {
        const date = entry["날짜 시간"].split(" ")[0];
        if (!processedData[date]) {
            processedData[date] = {
                date,
                entries: [],
                highTemp: -Infinity,
                lowTemp: Infinity,
            };
        }
        processedData[date].entries.push(entry);

        const temp = parseFloat(entry["기온"].replace("°C", ""));
        if (temp > processedData[date].highTemp) processedData[date].highTemp = temp;
        if (temp < processedData[date].lowTemp) processedData[date].lowTemp = temp;
    });

    return Object.values(processedData);
}

export const openWeatherData: OpenWeatherEntry[] = [
    {
        "날짜 시간": "20241209 0900",
        "기온": "6°C",
        "풍향": "동",
        "풍속": "0.61m/s",
        "하늘 상태": "흐림",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "62%"
    },
    {
        "날짜 시간": "20241209 1200",
        "기온": "6°C",
        "풍향": "북",
        "풍속": "1.31m/s",
        "하늘 상태": "흐림",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "66%"
    },
    {
        "날짜 시간": "20241209 1500",
        "기온": "3°C",
        "풍향": "북동",
        "풍속": "2.58m/s",
        "하늘 상태": "구름 많음",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "79%"
    },
    {
        "날짜 시간": "20241209 1800",
        "기온": "3°C",
        "풍향": "동",
        "풍속": "1.76m/s",
        "하늘 상태": "구름 많음",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "78%"
    },
    {
        "날짜 시간": "20241209 2100",
        "기온": "2°C",
        "풍향": "동",
        "풍속": "1.99m/s",
        "하늘 상태": "구름 낱개",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "81%"
    },
    {
        "날짜 시간": "20241210 0000",
        "기온": "3°C",
        "풍향": "동",
        "풍속": "2.43m/s",
        "하늘 상태": "구름 낱개",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "78%"
    },
    {
        "날짜 시간": "20241210 0300",
        "기온": "7°C",
        "풍향": "북동",
        "풍속": "2.53m/s",
        "하늘 상태": "구름 많음",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "61%"
    },
    {
        "날짜 시간": "20241210 0600",
        "기온": "8°C",
        "풍향": "북서",
        "풍속": "3.71m/s",
        "하늘 상태": "흐림",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "56%"
    },
    {
        "날짜 시간": "20241210 0900",
        "기온": "6°C",
        "풍향": "북",
        "풍속": "3.06m/s",
        "하늘 상태": "구름 많음",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "64%"
    },
    {
        "날짜 시간": "20241210 1200",
        "기온": "5°C",
        "풍향": "북동",
        "풍속": "2.8m/s",
        "하늘 상태": "흐림",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "71%"
    },
    {
        "날짜 시간": "20241210 1500",
        "기온": "4°C",
        "풍향": "북동",
        "풍속": "1.79m/s",
        "하늘 상태": "흐림",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "73%"
    },
    {
        "날짜 시간": "20241210 1800",
        "기온": "4°C",
        "풍향": "북동",
        "풍속": "1.63m/s",
        "하늘 상태": "흐림",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "73%"
    },
    {
        "날짜 시간": "20241210 2100",
        "기온": "4°C",
        "풍향": "북동",
        "풍속": "1.95m/s",
        "하늘 상태": "흐림",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "71%"
    },
    {
        "날짜 시간": "20241211 0000",
        "기온": "5°C",
        "풍향": "북동",
        "풍속": "1.31m/s",
        "하늘 상태": "흐림",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "68%"
    },
    {
        "날짜 시간": "20241211 0300",
        "기온": "7°C",
        "풍향": "북",
        "풍속": "2.73m/s",
        "하늘 상태": "흐림",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "57%"
    },
    {
        "날짜 시간": "20241211 0600",
        "기온": "8°C",
        "풍향": "북서",
        "풍속": "4.39m/s",
        "하늘 상태": "흐림",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "50%"
    },
    {
        "날짜 시간": "20241211 0900",
        "기온": "6°C",
        "풍향": "북서",
        "풍속": "4.39m/s",
        "하늘 상태": "구름 많음",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "58%"
    },
    {
        "날짜 시간": "20241211 1200",
        "기온": "4°C",
        "풍향": "북",
        "풍속": "3.81m/s",
        "하늘 상태": "구름 낱개",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "60%"
    },
    {
        "날짜 시간": "20241211 1500",
        "기온": "4°C",
        "풍향": "북",
        "풍속": "2.3m/s",
        "하늘 상태": "맑음",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "62%"
    },
    {
        "날짜 시간": "20241211 1800",
        "기온": "3°C",
        "풍향": "북",
        "풍속": "2.48m/s",
        "하늘 상태": "맑음",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "63%"
    },
    {
        "날짜 시간": "20241211 2100",
        "기온": "2°C",
        "풍향": "북",
        "풍속": "2.31m/s",
        "하늘 상태": "맑음",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "64%"
    },
    {
        "날짜 시간": "20241212 0000",
        "기온": "3°C",
        "풍향": "북",
        "풍속": "3.02m/s",
        "하늘 상태": "맑음",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "58%"
    },
    {
        "날짜 시간": "20241212 0300",
        "기온": "6°C",
        "풍향": "북",
        "풍속": "5.88m/s",
        "하늘 상태": "구름 낱개",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "42%"
    },
    {
        "날짜 시간": "20241212 0600",
        "기온": "6°C",
        "풍향": "북서",
        "풍속": "6.54m/s",
        "하늘 상태": "구름 낱개",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "41%"
    },
    {
        "날짜 시간": "20241212 0900",
        "기온": "4°C",
        "풍향": "북",
        "풍속": "3.88m/s",
        "하늘 상태": "흐림",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "50%"
    },
    {
        "날짜 시간": "20241212 1200",
        "기온": "3°C",
        "풍향": "북동",
        "풍속": "3.04m/s",
        "하늘 상태": "흐림",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "54%"
    },
    {
        "날짜 시간": "20241212 1500",
        "기온": "2°C",
        "풍향": "북동",
        "풍속": "1.47m/s",
        "하늘 상태": "흐림",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "55%"
    },
    {
        "날짜 시간": "20241212 1800",
        "기온": "2°C",
        "풍향": "북동",
        "풍속": "2.09m/s",
        "하늘 상태": "흐림",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "57%"
    },
    {
        "날짜 시간": "20241212 2100",
        "기온": "2°C",
        "풍향": "북동",
        "풍속": "1.92m/s",
        "하늘 상태": "흐림",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "60%"
    },
    {
        "날짜 시간": "20241213 0000",
        "기온": "2°C",
        "풍향": "동",
        "풍속": "2.07m/s",
        "하늘 상태": "흐림",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "59%"
    },
    {
        "날짜 시간": "20241213 0300",
        "기온": "5°C",
        "풍향": "남",
        "풍속": "1.91m/s",
        "하늘 상태": "흐림",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "53%"
    },
    {
        "날짜 시간": "20241213 0600",
        "기온": "7°C",
        "풍향": "서",
        "풍속": "4.49m/s",
        "하늘 상태": "가벼운 비",
        "강수 형태": "없음",
        "강수 확률": "21%",
        "습도": "66%"
    },
    {
        "날짜 시간": "20241213 0900",
        "기온": "7°C",
        "풍향": "서",
        "풍속": "6.85m/s",
        "하늘 상태": "가벼운 비",
        "강수 형태": "없음",
        "강수 확률": "100%",
        "습도": "60%"
    },
    {
        "날짜 시간": "20241213 1200",
        "기온": "7°C",
        "풍향": "북서",
        "풍속": "7.68m/s",
        "하늘 상태": "가벼운 비",
        "강수 형태": "없음",
        "강수 확률": "100%",
        "습도": "64%"
    },
    {
        "날짜 시간": "20241213 1500",
        "기온": "3°C",
        "풍향": "북",
        "풍속": "5.77m/s",
        "하늘 상태": "가벼운 비",
        "강수 형태": "없음",
        "강수 확률": "100%",
        "습도": "79%"
    },
    {
        "날짜 시간": "20241213 1800",
        "기온": "3°C",
        "풍향": "북",
        "풍속": "5.48m/s",
        "하늘 상태": "구름 많음",
        "강수 형태": "없음",
        "강수 확률": "88%",
        "습도": "60%"
    },
    {
        "날짜 시간": "20241213 2100",
        "기온": "2°C",
        "풍향": "북",
        "풍속": "4.51m/s",
        "하늘 상태": "구름 낱개",
        "강수 형태": "없음",
        "강수 확률": "23%",
        "습도": "65%"
    },
    {
        "날짜 시간": "20241214 0000",
        "기온": "3°C",
        "풍향": "북",
        "풍속": "4.5m/s",
        "하늘 상태": "구름 많음",
        "강수 형태": "없음",
        "강수 확률": "12%",
        "습도": "59%"
    },
    {
        "날짜 시간": "20241214 0300",
        "기온": "5°C",
        "풍향": "북서",
        "풍속": "7.75m/s",
        "하늘 상태": "흐림",
        "강수 형태": "없음",
        "강수 확률": "0%",
        "습도": "54%"
    },
    {
        "날짜 시간": "20241214 0600",
        "기온": "5°C",
        "풍향": "북서",
        "풍속": "8.26m/s",
        "하늘 상태": "가벼운 비",
        "강수 형태": "없음",
        "강수 확률": "20%",
        "습도": "53%"
    }
];

export async function initializeOpenWeatherData(): Promise<OpenWeatherEntry[]> {
    // This function can be used to fetch data dynamically if needed
    // For now, we're returning the static data
    return openWeatherData;
}
